toandeptrai16zz/flutter-fastapi-smarthome/firmware_esp32/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <PubSubClient.h>
#include <WiFiManager.h>
#include <ArduinoOTA.h>
#include <ArduinoJson.h> // Library for JSON parsing

// --- MQTT ---
const char *mqtt_server = "broker.hivemq.com";
const int mqtt_port = 1883;

// --- GPIO CONTROL TOPIC (NEW 2.0) ---
const char *topic_gpio_control = "smarthome/esp/gpio/control";

// --- SENSOR DHT11 ---
#define DHTPIN D1
#define DHTTYPE DHT11
DHT dht(DHTPIN, DHTTYPE);

WiFiClient espClient;
PubSubClient client(espClient);

void setup_wifi() {
  Serial.println("\n--- WiFi Management ---");
  WiFiManager wifiManager;
  if (!wifiManager.autoConnect("SmartHome-Config")) {
    Serial.println("❌ WiFi connection failed! Resetting...");
    delay(3000);
    ESP.restart();
  }
  Serial.println("✅ WiFi connected! IP: " + WiFi.localIP().toString());
}

// --- CALLBACK: XỬ LÝ LỆNH ĐIỀU KHIỂN CHÂN ĐỘNG ---
void callback(char *topic, byte *payload, unsigned int length) {
  Serial.print("📩 Message arrived [");
  Serial.print(topic);
  Serial.print("]: ");

  StaticJsonDocument<200> doc;
  DeserializationError error = deserializeJson(doc, payload, length);

  if (error) {
    Serial.print("JSON Parse failed: ");
    Serial.println(error.c_str());
    return;
  }

  if (String(topic) == topic_gpio_control) {
    int pin = doc["pin"];
    const char* action = doc["action"]; // "on" or "off"

    // Hỗ trợ tất cả chân Pin >= 0
    if (pin >= 0) {
      pinMode(pin, OUTPUT); 
      bool state = (String(action) == "on");
      digitalWrite(pin, state ? HIGH : LOW);
      
      Serial.print("⚡ Action: ");
      Serial.print(action);
      Serial.print(" | GPIO: ");
      Serial.print(pin);
      Serial.print(" | Logic: ");
      Serial.println(state ? "HIGH" : "LOW");
    }
  }
}

void reconnect() {
  int retries = 0;
  while (!client.connected()) {
    Serial.print("Connecting MQTT...");
    String clientId = "SmartHome-ESP-" + String(random(0xffff), HEX);

    if (client.connect(clientId.c_str())) {
      Serial.println("CONNECTED");
      // Subscribe vào topic điều khiển chân động duy nhất
      client.subscribe(topic_gpio_control);
      Serial.println("Subscribed to: " + String(topic_gpio_control));
    } else {
      Serial.print("failed, rc=");
      Serial.print(client.state());
      Serial.println(" retry in 5s");
      delay(5000);
      retries++;
      if (retries > 12) {
        Serial.println("Timeout! Restarting...");
        ESP.restart();
      }
    }
  }
}

void setup() {
  Serial.begin(115200);
  randomSeed(micros());

  dht.begin();
  setup_wifi();

  client.setServer(mqtt_server, mqtt_port);
  client.setCallback(callback);

  // OTA Support
  ArduinoOTA.setHostname("SmartHome-ESP-Dynamic");
  ArduinoOTA.begin();
  
  Serial.println("🚀 SmartHome Firmware 2.0 (Dynamic GPIO) Ready!");
}

unsigned long lastSensorTime = 0;

void loop() {
  ArduinoOTA.handle();

  if (WiFi.status() != WL_CONNECTED) {
    setup_wifi();
  }

  if (!client.connected()) {
    reconnect();
  }
  client.loop();

  // Đọc cảm biến mỗi 10 giây
  unsigned long now = millis();
  if (now - lastSensorTime > 10000) {
    lastSensorTime = now;

    float h = dht.readHumidity();
    float t = dht.readTemperature();

    if (!isnan(h) && !isnan(t)) {
      String payload = "{\"temperature\": " + String(t, 1) +
                       ", \"humidity\": " + String(h, 1) + "}";
      client.publish("smarthome/sensors/dht11/data", payload.c_str());
      Serial.println("📤 Published Sensor Data: " + payload);
    }
  }
}